Results/Verifications/S2427/bottleneck-determination/read_only/threads-12/sysbench.log
$ time sysbench --config-file=sysbench.conf --threads=12 oltp_read_only --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-type=
uniform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 12
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 12 tps: 91.65 qps: 1478.12 (r/w/o: 1293.71/0.00/184.40) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 12 tps: 169.41 qps: 2711.75 (r/w/o: 2372.83/0.00/338.92) lat (ms,95%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 12 tps: 193.70 qps: 3098.51 (r/w/o: 2711.10/0.00/387.40) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 12 tps: 199.20 qps: 3189.10 (r/w/o: 2790.70/0.00/398.40) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 12 tps: 197.30 qps: 3155.40 (r/w/o: 2760.80/0.00/394.60) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 12 tps: 197.80 qps: 3164.29 (r/w/o: 2768.69/0.00/395.60) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 12 tps: 204.90 qps: 3281.01 (r/w/o: 2871.20/0.00/409.80) lat (ms,95%): 66.84 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 12 tps: 197.70 qps: 3163.21 (r/w/o: 2767.81/0.00/395.40) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 12 tps: 195.30 qps: 3123.30 (r/w/o: 2732.70/0.00/390.60) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 12 tps: 197.80 qps: 3163.29 (r/w/o: 2767.69/0.00/395.60) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            258440
        write:                           0
        other:                           36920
        total:                           295360
    transactions:                        18460  (184.49 per sec.)
    queries:                             295360 (2951.78 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0571s
    total number of events:              18460

Latency (ms):
         min:                                   46.88
         avg:                                   65.02
         max:                                  263.79
         95th percentile:                      101.13
         sum:                              1200299.81

Threads fairness:
    events (avg/stddev):           1538.3333/3.88
    execution time (avg/stddev):   100.0250/0.01


real    1m40.567s
user    0m12.060s
sys     0m15.956s